emacs/language-modes/ide-features.org
#+title: IDE Features Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle ide-features.el
#+auto_tangle: y

* Introduction
This file provides an overview of IDE-like features in Emacs and loads the individual configuration files for various programming tools and language modes.

* Basic Configuration
Setup lexical binding for better closures and variable scoping.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

* Development Environment Configuration
Load the core configuration files for various IDE features and language modes.

#+begin_src emacs-lisp
;; ===============================================================================
;; Development Environment Configuration
;; ===============================================================================

;; Load GTags configuration
(load "~/src/dotfiles/emacs/language-modes/gtags.el")

;; Load Tree-sitter configuration
(load "~/src/dotfiles/emacs/language-modes/tree-sitter.el")

;; Configure common modes
(load "~/src/dotfiles/emacs/language-modes/yaml.el")
(load "~/src/dotfiles/emacs/language-modes/json.el")
(load "~/src/dotfiles/emacs/language-modes/markdown-mode.el")
(load "~/src/dotfiles/emacs/language-modes/terraform.el")
(load "~/src/dotfiles/emacs/language-modes/puppet-mode.el")

;; Load language-specific configurations
(load "~/src/dotfiles/emacs/language-modes/python.el")
(load "~/src/dotfiles/emacs/language-modes/typescript.el")
(load "~/src/dotfiles/emacs/language-modes/golang.el")
(load "~/src/dotfiles/emacs/language-modes/docker.el")

;; Load tool configurations
(load "~/src/dotfiles/emacs/language-modes/projectile.el")
(load "~/src/dotfiles/emacs/language-modes/yasnippet.el")
(load "~/src/dotfiles/emacs/language-modes/copilot.el")
#+end_src

* Additional Packages
** Writable Grep
Allows editing text directly in grep results buffers.

[[https://github.com/mhayashi1120/Emacs-wgrep][Documentation]]

#+begin_src emacs-lisp
(use-package wgrep
  :straight t)
#+end_src

* Usage Notes
** Available IDE Features
This configuration provides several IDE-like features for Emacs:

- Project management with Projectile
- Code navigation with GTags
- Syntax highlighting with Tree-sitter
- Completion with Copilot and YASnippet
- Language-specific modes and tools

** Adding New Languages
To add support for a new programming language:

1. Create a dedicated .org file in the language-modes directory
2. Configure the necessary packages for that language
3. Add the language to treesit-language-source-alist if applicable
4. Add a load statement in this file

* TODO Improvements
- Consider integrating LSP mode for more languages
- Add support for additional languages
- Improve integration between different completion systems
- Add debugging support for various languages
